# SolidGeometryOptions Properties

---
The SolidGeometryOptions type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| SolidTag|  Optional solid tag for the Solid.
Top
#### Reference
SolidGeometryOptions Class
Autodesk.Revit.DB Namespace